10 REM РАЗМЕР ПОЛЯ И КОЛИЧЕСТВО МИН
11 DATA 12,10,20
12 READ NX,NY,NM
20 N0=0 'КОЛИЧЕСТВО ОТКРЫТЫх КЛЕТОК
21 N1=NX*NY-NM 'КОЛИЧЕСТВО КЛЕТОК бЕЗ МИН
50 WIN=0 'ПОСТАВИМ В 1 ПРИ ПОбЕДЕ
60 REM ЛЕВЫЙ ВЕРхНИЙ УГОЛ
61 X0=INT((255-NX*11)/2)
62 Y0=INT((240-NY*11)/2)
70 DIM CUR(4) '0,1 - X,Y; 2,3 - НОВЫЕ КООРДИНАТЫ
71 CUR(0)=INT(NX/2)
72 CUR(1)=INT(NY/2)
90 DIM MAP%(NX,NY) 'КАРТА ПОЛЯ
91 GOSUB 9000 'ЗАПОЛНЕНИЕ ПОЛЯ МИНАМИ И СЧЕТЧИКАМИ
95 DIM S1%(2), S2%(2,NX*NY), S3%(NX,NY) 'МАССИВЫ ДЛЯ РАСКРЫТИЯ ПУСТЫх ОбЛАСТЕЙ
100 CLS
110 ? AT(8,0);"ИЩЕМ МИНЫ (";NM;")"
140 GOSUB 2000 'РИСУЕМ ПОЛЕ
141 GOSUB 2600 'СТАВИМ КУРСОР
150 ? AT(5,1); "ОТКРЫТО КЛЕТОК:";N0;"/";N1
160 GOSUB 1000 'ПОЛУЧИЛИ КОД В DD
170 ON DD GOSUB 3000,3000,3000,3000,4000,5000
190 GOTO 150
1000 REM РАбОТА С КЛАВИАТУРОЙ
1001 REM ВОЗВРАЩАЕТ 1..4 ДЛЯ НАПРАВЛЕНИЯ, 5 ДЛЯ ПРОбЕЛА, 6 ДЛЯ ВВОДА
1002 DATA 8%,25%,26%,27%,32%,10%
1010 K$=INKEY$
1011 IF K$="" GOTO 1010
1020 RESTORE 1002
1022 FOR I=1 TO 6
1023 READ KC
1024 IF ABS(K$)=KC GOTO 1030
1025 NEXT I
1029 GOTO 1010
1030 DD=I
1040 RETURN
2000 REM РИСОВАНИЕ ПОЛЯ
2001 REM NX,NY - РАЗМЕРЫ ПОЛЯ
2002 REM X0,Y0 - ЛЕВЫЙ ВЕРхНИЙ УГОЛ
2010 IF NX>NY THEN N=NX ELSE N=NY
2011 DX=NX/N
2012 DY=NY/N
2020 X=0
2021 Y=0
2030 FOR I=1 TO N-1
2031 X1=X+DX
2032 Y1=Y+DY
2041 XX=INT(X1)
2042 YY=INT(Y1)
2045 GOSUB 2500 'РИСУЕМ ДИАГОНАЛЬНУЮ КЛЕТКУ
2051 X2=X1
2052 Y2=Y1
2060 FOR I2=I TO 1 STEP -1
2061 X3=X2-DX
2062 Y3=Y2-DY
2071 XX=FIX(X3) 'НАЛЕВО ОТ ДИАГОНАЛИ
2072 IF XX=FIX(X2) GOTO 2080
2073 YY=INT(Y1)
2075 GOSUB 2500 
2080 YY=FIX(Y3) 'НАВЕРх ОТ ДИАГОНАЛИ
2081 IF YY=FIX(Y2) GOTO 2090
2082 XX=INT(X1)
2085 GOSUB 2500
2090 X2=X3 
2091 Y2=Y3
2097 NEXT I2
2100 X=X1 'ФИКСИРУЕМ НОВУю ТОЧКУ НА ДИАГОНАЛИ
2101 Y=Y1
2110 NEXT I
2190 RETURN
2300 REM РИСОВАНИЕ ОТКРЫТОЙ КЛЕТКИ, КООРДИНАТЫ (XX,YY)
2310 SX=X0+XX*11
2311 SY=Y0+YY*11
2320 PAINT (SX+2,SY+2),0,3
2321 COLOR 1
2322 PSET (SX+2,SY+2),4 'СТАВИМ ОПОРНУю ТОЧКУ
2330 ON MAP%(XX,YY) GOTO 2350,2360,2370,2380,2390,2400,2410,2420,2430
2340 RETURN 'НЕЧЕГО РИСОВАТЬ
2350 DRAW "BM+1,4;E3D5L2R3" '1
2351 RETURN
2360 DRAW "BM+1,3;E2R1F1D1G3R3" '2
2361 RETURN
2370 DRAW "BM+1,3;E2R1F1G1F1D1G1L1H1" '3
2371 RETURN
2380 DRAW "BM+4,0;G2D1R3U2D5" '4
2381 RETURN
2390 DRAW "BM+6,1;L4D2R2F1D1G1L2" '5
2391 RETURN
2400 DRAW "BM+6,1;L3G1D3F1R1E1U1H1L1" '6
2401 RETURN
2410 DRAW "BM+1,1;R4D2G3" '7
2411 RETURN
2420 DRAW "BM+2,1;ND1R2F1G1L1G1D1F1R1E1U1" '8
2421 RETURN
2430 DRAW "BM+0,1;R1F1R3F1L4G1R4D1L3G1;BM+2,0;R1;BM+1,0;R1;BM-4,-5,R1;BM+2,0;R1" 'МИНА
2431 RETURN
2500 REM РИСОВАНИЕ ОДНОЙ КЛЕТКИ ПО (XX,YY)
2505 SX=X0+XX*11
2506 SY=Y0+YY*11
2510 LINE (SX+1,SY+1)-(SX+10,SY+10),3,B
2520 PAINT (SX+2,SY+2),2,3
2525 RETURN
2600 REM РИСОВАНИЕ КУРСОРА ПО CUR(0),CUR(1)
2610 SX=X0+CUR(0)*11
2611 SY=Y0+CUR(1)*11
2620 LINE(SX,SY)-(SX+11,SY+11),1,B
2630 RETURN
2700 REM СТИРАНИЕ КУРСОРА ПО CUR(0),CUR(1)
2710 SX=X0+CUR(0)*11
2711 SY=Y0+CUR(1)*11
2720 LINE(SX,SY)-(SX+11,SY+11),0,B
2730 RETURN
3000 REM ПЕРЕМЕЩЕНИЕ КУРСОРА
3001 REM КУРСОР В CUR(0),CUR(1)
3002 REM DD-НАПРАВЛЕНИЕ ДВИжЕНИЯ
3003 REM 1-LEFT,2-RIGHT,3-UP,4-DOWN
3010 CUR(2)=CUR(0)
3011 CUR(3)=CUR(1)
3020 ON DD GOTO 3030,3040,3050,3060
3022 STOP 'ЧИСТО ДЛЯ ОТЛАДКИ
3030 ' LEFT
3031 IF CUR(2)=0 GOTO 3070
3032 CUR(2)=CUR(2)-1
3033 GOTO 3080
3040 ' RIGHT
3041 IF CUR(2)=NX-1 GOTO 3070
3042 CUR(2)=CUR(2)+1
3043 GOTO 3080
3050 ' UP
3051 IF CUR(3)=0 GOTO 3070
3052 CUR(3)=CUR(3)-1
3053 GOTO 3080
3060 ' DOWN
3061 IF CUR(3)=NY-1 GOTO 3070
3062 CUR(3)=CUR(3)+1
3063 GOTO 3080
3070 RETURN 'КУРСОР НЕ ДВИГАЕМ
3080 ' УбРАТЬ КУРСОР
3081 GOSUB 2070
3090 'НАРИСОВАТЬ КУРСОР
3091 CUR(0)=CUR(2)
3092 CUR(1)=CUR(3)
3093 GOSUB 2600
3099 RETURN
4000 REM ОТКРЫВАЕМ ПОЛЕ
4010 IF MAP%(CUR(0),CUR(1)) < 100 TH RETURN 'УжЕ ОТКРЫТА
4020 XX=CUR(0)
4021 YY=CUR(1)
4022 GOSUB 4200 'ОбРАбОТКА КЛЕТКИ
4030 IF MAP%(XX,YY)=9 TH 8000 'КОНЕЦ ИГРЫ
4031 IF MAP%(XX,YY)=0 TH GOSUB 4100 'ОТКРЫВАЕМ УЧАСТОК
4060 IF N0<N1 GOTO 4090
4062 WIN=1 'ПОбЕДА
4063 GOTO 8000 
4090 RETURN
4100 REM ОТКРЫВАЕМ ПУСТОЙ УЧАСТОК ВОКРУГ ТЕКУЩЕЙ КЛЕТКИ
4101 DATA -1%,-1%,0%,-1%,1%,-1%,-1%,0%,1%,0%,-1%,1%,0%,1%,1%,1%
4110 S1%(0)=-1 'ТЕКУЩАЯ ПОЗИЦИЯ НА СТЕКЕ
4111 S1%(1)=0 'ПОСЛЕДНЯЯ ПОЗИЦИЯ НА СТЕКЕ
4112 FOR XX=0 TO NX-1 'ЗАЧИЩАЕМ КАРТУ ОбРАбОТАННЫх ТОЧЕК
4113 FOR YY=0 TO NY-1
4114 S3%(XX,YY)=-1
4115 NEXT YY,XX
4120 REM НАЧАЛЬНАЯ ТОЧКА
4121 S2%(0,0)=CUR(0)
4122 S2%(1,0)=CUR(1)
4130 REM ОЧЕРЕДНАЯ ТОЧКА
4131 S1%(0)=S1%(0)+1
4140 REM СМОТРИМ НА ОКРЕСТНОСТИ ТОЧКИ
4141 RESTORE 4101 'СМЕЩЕНИЯ ДЛЯ ОКРЕСТНОСТИ
4142 FOR I=0 TO 7
4143 READ XX,YY
4144 XX=XX+S2%(0,S1%(0))
4145 YY=YY+S2%(1,S1%(0))
4146 IF XX<0 OR XX>=NX TH 4170
4147 IF YY<0 OR YY>=NY TH 4170
4148 IF MAP%(XX,YY)<100 TH 4170 ' УжЕ ОТКРЫТА
4150 REM ОбРАбОТКА ТОЧКИ
4151 GOSUB 4200 'ОТКРЫВАЕМ ТОЧКУ
4152 IF MAP%(XX,YY)>0 TH 4170 ' КЛЕТКА НЕ ПУСТАЯ, С НЕЙ ЗАКОНЧИЛИ
4153 IF S3%(XX,YY)>-1 TH 4170 ' КЛЕТКА УжЕ В СТЕКЕ
4160 REM ДОбАВЛЯЕМ КЛЕТКУ В СТЕК
4161 S1%(1)=S1%(1)+1
4162 S3%(XX,YY)=S1%(1) 'ПОМЕТИЛИ КЛЕТКУ
4163 S2%(0,S1%(1))=XX
4164 S2%(1,S1%(1))=YY
4170 NEXT I
4180 IF S1%(0)<S1%(1) GOTO 4130 'ПОВТОР, ПОКА В СТЕКЕ ЕСТЬ КЛЕТКИ
4190 RETURN
4200 REM ОТКРЫВАЕМ КЛЕТКУ
4210 IF MAP%(XX,YY)<100 TH RETURN 'УжЕ ОТКРЫТА
4220 MAP%(XX,YY)=MAP%(XX,YY)-100
4230 GOSUB 2300 'ОТРИСОВАТЬ КЛЕТКУ
4240 N0=N0+1
4290 RETURN
5000 REM СТАВИМ/УбИРАЕМ ФЛАГ
5005 IF MAP%(CUR(0),CUR(1))<100 TH RETURN
5010 SX=X0+CUR(0)*11
5011 SY=Y0+CUR(1)*11
5015 REM ЕСЛИ ФЛАГ УжЕ ЕСТЬ - УбИРАЕМ (СМОТРИМ ПО ЦВЕТУ)
5016 IF POINT(SX+5,SY+5)=1 TH COLOR 2 EL COLOR 1
5020 PSET (SX+2,SY+2),2 'ОПОРНАЯ ТОЧКА
5030 DRAW "BM+3,3;R2H2D5L1R3" ' ФЛАГ
5040 RETURN
8000 REM КОНЕЦ ИГРЫ
8010 REM ОТКРЫВАЕМ ТЕКУЩУю КЛЕТКУ
8020 REM РИСУЕМ НЕОТКРЫТЫЕ МИНЫ
8021 FOR XX=0 TO NX-1
8022 FOR YY=0 TO NY-1
8023 IF MAP%(XX,YY)<>109 GOTO 8026
8024 MAP%(XX,YY)=MAP%(XX,YY)-100
8025 GOSUB 2300 ' РИСУЕМ МИНУ
8026 NEXT YY,XX
8030 IF WIN=1 TH 8060 EL 8070
8060 ? AT(0,0);"                                "
8061 ? AT(0,1);"       !!!! ПОбЕДА !!!!         "
8069 GOTO 8080
8070 ? AT(0,0);"                                "
8071 ? AT(0,1);"   !! НАШЛИ МИНУ И УбИЛИСЬ !!   "
8080 END
9000 REM ЗАПОЛНЕНИЕ ПОЛЯ МИНАМИ И СЧЕТЧИКАМИ
9001 ' 0..8 - КОЛИЧЕСТВО МИН ВОКРУГ
9002 ' 9-МИНА
9003 '+100 - ЕЩЕ НЕ ОТКРЫТАЯ КЛЕТКА
9010 FOR X=0 TO NX-1
9011 FOR Y=0 TO NY-1
9012 MAP%(X,Y)=0%
9013 NEXT Y,X
9100 FOR I=1 TO NM 'РАССТАНОВКА МИН И СЧЕТЧИКОВ
9110 MX=(1000*RND(1) MOD NX)
9111 MY=(1000*RND(1) MOD NY)
9120 IF MAP%(MX,MY)=9 GOTO 9110 'УжЕ ЕСТЬ МИНА
9130 MAP%(MX,MY)=9
9150 REM СЧЕТЧИКИ
9151 IF MX>0 TH X1=MX-1 EL X1=MX
9152 IF MX<NX-1 TH X2=MX+1 EL X2=MX
9153 IF MY>0 TH Y1=MY-1 EL Y1=MY
9154 IF MY<NY-1 TH Y2=MY+1 EL Y2=MY
9160 FOR X=X1 TO X2
9161 FOR Y=Y1 TO Y2
9162 IF MAP%(X,Y) <> 9 TH MAP%(X,Y)=MAP%(X,Y)+1
9163 NEXT Y,X
9170 NEXT I
9180 REM ПОМЕЧАЕМ НЕОТКРЫТЫМИ
9181 FOR X=0 TO NX-1
9182 FOR Y=0 TO NY-1
9183 MAP%(X,Y)=MAP%(X,Y)+100
9184 NEXT Y,X
9190 RETURN
